/*
Пользователь вводит число, необходимо увеличить это число на 15% и вывести результат на экран
*/

public class Main {

    public static void main(String[] args) {
        double a = 100;
        System.out.println(a + 15.0/100.0);
    }
}
